# More Practice With SQL Queries - Lab

## Introduction

In this lesson, we'll run through some practice questions to refresh our knowledge of SQL Queries!

## Objectives

You will be able to:

- Practice your SQL knowledge

## Getting Started

As in previous labs, we'll make use of the `sqlite3` library as well as `pandas`. By combining them, we'll be able to write our queries as python strings, and make sure that the results are always returned as a pandas DataFrame. 

We'll start by loading both libraries and connecting to the database we'll be using for this lab, `data.sqlite`. You may remember this database from a previous lab. As a refresher, here's the ERD diagram for this database: 

<img src='images/Database-Schema.png'>

In the cell below:

* Import the necessary libraries `pandas` and `sqlite3`
* Establish a connection to the database `data.sqlite`
* Get the `cursor` from the connection and store it in the variable `c`.

In [3]:
import pandas as pd
import sqlite3
conn = sqlite3.Connection('data.sqlite')
c = conn.cursor()

## Basic Queries

Now, let's review basic SQL queries. In the cell below:

* Write a query that gets the first name, last name, phone number, address, and credit limit for all customers in California with a credit limit greater than 25000.00.

In [4]:
# For the first query, the boilerplate for getting 
#the query into a dataframe has been provided for you
c.execute(""" 
    select *
    from sqlite_master
;""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

,type,name,tbl_name,rootpage,sql
0,table,orderdetails,orderdetails,2,"CREATE TABLE `orderdetails` (`orderNumber`, `p..."
1,table,payments,payments,28,"CREATE TABLE `payments` (`customerNumber`, `ch..."
2,table,offices,offices,32,"CREATE TABLE `offices` (`officeCode`, `city`, ..."
3,table,orders,orders,38,"CREATE TABLE `orders` (`orderNumber`, `orderDa..."
4,table,productlines,productlines,46,"CREATE TABLE `productlines` (`productLine`, `t..."
5,table,products,products,47,"CREATE TABLE `products` (`productCode`, `produ..."
6,table,employees,employees,56,"CREATE TABLE `employees` (`employeeNumber`, `l..."
7,table,customers,customers,33,CREATE TABLE customers (customerNumber INTEGE...

In [8]:
# For the first query, the boilerplate for getting 
#the query into a dataframe has been provided for you
c.execute(""" 
    select contactFirstName, contactLastName, phone, addressLine1, creditLimit
    from customers
    where creditLimit > 25000 and state = 'CA'
;""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

,contactFirstName,contactLastName,phone,addressLine1,creditLimit
0,Susan,Nelson,4155551450,5677 Strong St.,210500.0
1,Julie,Murphy,6505555787,5557 North Pendale Street,64600.0
2,Juri,Hashimoto,6505556809,9408 Furth Circle,84600.0
3,Julie,Young,6265557265,78934 Hillside Dr.,90700.0
4,Valarie,Thompson,7605558146,361 Furth Circle,105000.0
5,Julie,Brown,6505551386,7734 Strong St.,105000.0
6,Brian,Chandler,2155554369,6047 Douglas Av.,57700.0
7,Sue,Frick,4085553659,3086 Ingle Ln.,77600.0
8,Steve,Thompson,3105553722,3675 Furth Circle,55400.0
9,Sue,Taylor,4155554312,2793 Furth Circle,60300.0

#### Expected Output

<img src='images/expected-output-1.png'>

## Aggregate Functions and GROUP BY

Next, write a query that get sthe average credit limit per state.

In [12]:
c.execute(""" 
    select state, avg(creditLimit) as avg_cred_lim
    from customers
    group by state
    --order by 2 desc
;""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

            state   avg_cred_lim
0                   61839.726027
1              BC   89950.000000
2              CA   83854.545455
3              CT   57350.000000
4        Co. Cork       0.000000
5   Isle of Wight   93900.000000
6              MA   70755.555556
7              NH  114200.000000
8              NJ   43000.000000
9             NSW  100550.000000
10             NV   71800.000000
11             NY   89966.666667
12          Osaka   81200.000000
13             PA   84766.666667
14       Pretoria       0.000000
15     Queensland   51600.000000
16         Québec   48700.000000
17          Tokyo   94400.000000
18       Victoria   88800.000000

#### Expected Output

<img src='images/expected-output-2.png'>

## JOINs

Now, write a query that uses JOIN statements to get the customer name, customer number, order number, status, and quantity ordered. Print only the head of this DataFrame.

In [22]:
c.execute(""" 
    select contactFirstName, contactLastName, c.customerNumber, orderNumber, status
    from customers c
    left join orders o
    on c.customerNumber = o.customerNumber
    left joing orderdetails d
    on d.
    
;""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

    contactFirstName contactLastName  customerNumber orderNumber      status
0            Carine          Schmitt             103       10123     Shipped
1            Carine          Schmitt             103       10298     Shipped
2            Carine          Schmitt             103       10345     Shipped
3               Jean            King             112       10124     Shipped
4               Jean            King             112       10278     Shipped
5               Jean            King             112       10346     Shipped
6              Peter        Ferguson             114       10120     Shipped
7              Peter        Ferguson             114       10125     Shipped
8              Peter        Ferguson             114       10223     Shipped
9              Peter        Ferguson             114       10342     Shipped
10             Peter        Ferguson             114       10347     Shipped
11           Janine          Labrune             119       10275     Shipped
12           Janine          Labrune             119       10315     Shipped
13           Janine          Labrune             119       10375     Shipped
14           Janine          Labrune             119       10425  In Process
15            Jonas       Bergulfsen             121       10103     Shipped
16            Jonas       Bergulfsen             121       10158     Shipped
17            Jonas       Bergulfsen             121       10309     Shipped
18            Jonas       Bergulfsen             121       10325     Shipped
19             Susan          Nelson             124       10113     Shipped
20             Susan          Nelson             124       10135     Shipped
21             Susan          Nelson             124       10142     Shipped
22             Susan          Nelson             124       10182     Shipped
23             Susan          Nelson             124       10229     Shipped
24             Susan          Nelson             124       10271     Shipped
25             Susan          Nelson             124       10282     Shipped
26             Susan          Nelson             124       10312     Shipped
27             Susan          Nelson             124       10335     Shipped
28             Susan          Nelson             124       10357     Shipped
29             Susan          Nelson             124       10368     Shipped
..               ...             ...             ...         ...         ...
320            Sven          Ottlieb             459        None        None
321          Violeta         Benitez             462       10166     Shipped
322          Violeta         Benitez             462       10321     Shipped
323          Violeta         Benitez             462       10388     Shipped
324           Carmen           Anton             465        None        None
325             Sean        Clenahan             471       10193     Shipped
326             Sean        Clenahan             471       10265     Shipped
327             Sean        Clenahan             471       10415    Disputed
328           Franco         Ricotti             473       10157     Shipped
329           Franco         Ricotti             473       10218     Shipped
330            Steve        Thompson             475       10199     Shipped
331            Steve        Thompson             475       10215     Shipped
332           Hanna             Moos             477        None        None
333       Alexander          Semenov             480        None        None
334           Raanan     Altagar,G M             481        None        None
335      José Pedro             Roel             484       10184     Shipped
336      José Pedro             Roel             484       10303     Shipped
337             Rosa         Salazar             486       10109     Shipped
338             Rosa         Salazar             486       10236     Shipped
339             Rosa         Salazar             486       10331     Shipped
340              Sue          Taylor             487       10149     Shipped
341              Sue          Taylor             487       10219     Shipped
342          Thomas            Smith             489       10186     Shipped
343          Thomas            Smith             489       10213     Shipped
344          Valarie          Franco             495       10207     Shipped
345          Valarie          Franco             495       10243     Shipped
346             Tony         Snowden             496       10138     Shipped
347             Tony         Snowden             496       10179   Cancelled
348             Tony         Snowden             496       10360     Shipped
349             Tony         Snowden             496       10399     Shipped

[350 rows x 5 columns]

In [25]:
c.execute(""" 
    select *
    from orderdetails
    limit 1
;""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

  orderNumber productCode quantityOrdered priceEach orderLineNumber
0       10100    S18_1749              30    136.00               3

#### Expected Output

<img src='images/expected-output-3.png'>

## HAVING and ORDER BY

Now, return the customerName, customrerNumber, productName, productCode and total number ordered for any product a customer has bought 10 or more of cumulatively. Sort the rows in descending order by the quantity ordered. 

**_Hint_**: For this one, you'll need to make use of HAVING, GROUP BY, and ORDER BY--make sure you get the order of them correct!

#### Expected Output

<img src='images/expected-output-4.png'>

## Subqueries

Finally, get the first name, last name, employee number, and office code for employees from an office with less than 5 employees.

#### Expected Output

<img src='images/expected-output-5.png'>

# Summary

In this lesson, we reviewed all the major concepts and keywords associated with SQL queries!